# Реалізуйте генератор, який приймає на вхід будь-яку ітерабельну послідовність (рядок, список, кортеж) і повертає
# генератор, який буде вертати значення з цієї послідовності, при цьому, якщо було повернено останній елемент із
# послідовності - ітерація починається знову.
#    Приклад (якщо запустили його у себе - натисніть Ctrl+C ;) ):


def generator(iterable_collection: list) -> int:
    while True:
        for i in iterable_collection:
            yield i


if __name__ == "__main__":
    collection = (1, 2, 3, 4, 5, 6, 7, 8, 9)
    a = generator(collection)
    for el in a:
        print(el)
