# Напишіть функцію, яка приймає 2 списки. Результатом має бути новий список, в якому
# знаходяться елементи першого списку, яких немає в другому. Порядок елементів, що залишилися
# має відповідати порядку в першому (оригінальному) списку. Реалізуйте обчислення за допомогою генератора.
#     Приклад:
#     array_diff([1, 2], [1]) --> [2]
#     array_diff([1, 2, 2, 2, 4, 3, 4], [2]) --> [1, 4, 3, 4]

def list_zipper(first_list: list, second_list: list) -> list:
    return [el for el in first_list if el not in second_list]


if __name__ == "__main__":
    print(list_zipper([1, 2, 2, 2, 4, 3, 4], [2]))
