"""Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями. Створiть просту умовну конструкцiю (звiсно вона повинна бути в тiлi ф-цiї), пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" та у випадку нервіності - виводити ще і різницю.
    Повиннi опрацювати такi умови (x, y, z заміність на відповідні числа):
    x > y;       вiдповiдь - "х бiльше нiж у на z"
    x < y;       вiдповiдь - "у бiльше нiж х на z"
    x == y.      вiдповiдь - "х дорiвнює z" """

def x_vs_y(x, y):
    if x > y:
        z = x - y
        return f" x > y на {z}"
    elif x < y:
        z = y - x
        return f" x < y на {z}"
    elif x == y:
        z = x
        return f" x дорівнює y - {z}"


print(x_vs_y(int(input("Enter 'x' int value ")), int(input("Enter 'y' int value "))))
